package com.github.weichun97.strategydemo.v4;

/**
 * 1. 使用空对象模式去掉判空处理
 * 2. 使用模板方法模式省略掉固定的操作方法
 *
 * 当前模式下还存在的可优化的点：
 * 1. 每次增加新的类型都需要
 *      1. 增加1个支付类型常量，
 *      2. 创建新的支付类，
 *      3. 工厂的静态方法需要手动注入新创建的支付类
 *
 * @author chun
 * @date 2021/6/24 10:38
 */
public class Start {
    public static void main(String[] args) {
        int type = 3;

        // 根据类型获取对应的支付类
        BasePay pay = PayFactory.get(type);

        // 其他业务逻辑 50 行
        // .................
        // .................
        // .................
        // .................

        pay.truePay();

        // 其他业务逻辑 50 行
        // .................
        // .................
        // .................
        // .................
    }
}
